#создание фиктивных целей, при наличия в дирректории файлов с аналогичными именами

.PHONY: all clean

# Инициализация переменных 
TARGET = Reader
CC = g++

PREF_OBJ = ./obj/
PREF_SRC = ./src/

#vpath %.cpp  src
#vpath %.h  src

#Получение всех имен исходных файлов в дирректории src
SRC = $(wildcard $(PREF_SRC)*.cpp)
 
# Переменная для хранения всех объектных файлов исходя из имен исходных кодов
# $(patsubst шаблон_поиска, шаблон_замены, список_слов)
OBJ = $(patsubst $(PREF_SRC)%.cpp, $(PREF_OBJ)%.o, $(SRC))

#<Цель> : <требования>
#	<действия>

# Шаблонные правила для линковки объектных файлов
$(TARGET) : $(OBJ)
	$(CC) $(OBJ) -o $(TARGET)

# Шаблонные правила для компиляции объектных файлов

$(PREF_OBJ)%.o : $(PREF_SRC)%.cpp
	$(CC) -c $< -o $@

#Удаление объектных файлов совместно с каталогом	
clean:
	rm -rf $(TARGET) $(PREF_OBJ)*.o
	
#Создание каталога для хранения объектных файлов
mkdir:
	mkdir obj
 
